## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                RESOURCE                                 |
|--------|-------------------------------------------------------------------------|
| add    | `aws_rds_cluster_parameter_group.superset_db`                           |
| update | `module.superset_db.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]` |
|        | `module.superset_db.aws_rds_cluster.cluster`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.superset_db will be created
  + resource "aws_rds_cluster_parameter_group" "superset_db" {
      + arn         = (known after apply)
      + description = "RDS parameter group that enables pgAudit"
      + family      = "aurora-postgresql15"
      + id          = (known after apply)
      + name        = "superset-db-pg-audit"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "pgaudit.log"
          + value        = "role,write,ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pgaudit,pg_stat_statements"
        }
    }

  # module.superset_db.aws_cloudwatch_log_group.log_exports["postgresql"] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_exports" {
        id                = "/aws/rds/cluster/superset-staging-cluster/postgresql"
        name              = "/aws/rds/cluster/superset-staging-cluster/postgresql"
      ~ retention_in_days = 7 -> 30
        tags              = {
            "CostCentre" = "cds-superset-staging"
            "Name"       = "superset-staging-cluster"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.superset_db.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ db_cluster_parameter_group_name       = "default.aurora-postgresql15" -> "superset-db-pg-audit"
        id                                    = "superset-staging-cluster"
        tags                                  = {
            "CostCentre" = "cds-superset-staging"
            "Name"       = "superset-staging-cluster"
            "Terraform"  = "true"
        }
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
